/******************************************************
æ–‡ä»¶åï¼š	MemIf.h

æè¿°ï¼	

Data			  Vasion			author
2018/1/13		  V1.0			    liujian
*******************************************************/
#ifndef		MEMIF_H
#define		MEMIF_H
/*******************************************************
descriptionï¼include the header file
*******************************************************/
#include "MemIf_cfg.h"


/*******************************************************
descriptionï¼macro definitions
*******************************************************/
/**********å®å¼€å…³å®šä¹********/

/**********å®å¸¸é‡å®šä¹********/



/***********å®å‡½æ•**********/

/*******************************************************
descriptionï¼struct definitions
*******************************************************/

/*******************************************************
descriptionï¼typedef definitions
*******************************************************/
/*****struct definitions*****/

/******enum definitions******/

/******union definitions*****/

/*******************************************************
descriptionï¼variable External declaration
*******************************************************/

/*******************************************************
descriptionï¼function External declaration
*******************************************************/
extern uint8 MemIf_ReadEE(uint8 Le_u_Object,uint8* Le_u_Data,uint8 Le_u_Lng);
extern uint8 MemIf_WriteEE(uint8 Le_u_Object,uint8* Le_u_Data,uint8 Le_u_Lng);

#endif
